#+TITLE: Floating point modulus in Scheme
#+AUTHOR: 8dcc
#+OPTIONS: toc:2
#+STARTUP: nofold
#+PROPERTY: header-args:scheme :tangle fmod.scm
#+PROPERTY: header-args:C      :tangle fmod.c

* The recursive Scheme version

I started with this simple function that supports only positive values.

#+begin_src scheme
;; Calculate remainder of X by Y. Supports floating point, but only positive
;; values.
(define (fmod x y)
  (if (< x y)
      x
      (fmod (- x y) y)))
#+end_src

Then, after a very non-mathematical approach, I came up with this version, that
supports both positive and negative values. See also [[file:../../../LaTeX/math/math.pdf][my math notes]].

#+begin_src scheme
;; Calculate remainder of X by Y, supporting floating point and negative values.
(define (fmod x y)
  ;; Calculate remainder of X by Y, as long as they are both positive.
  (define (fmod-positive x y)
    (if (< x y)
        x
        (fmod-positive (- x y) y)))

  ;; If X is negative: X mod Y = Y - (|X| mod Y)
  (define (fmod-y-positive x y)
    (if (< x 0)
        (- y (fmod-positive (- x) y))
        (fmod-positive x y)))

  ;; If X is negative: X mod Y = -(-X mod -Y)
  (if (< y 0)
      (- (fmod-y-positive (- x) (- y)))
      (fmod-y-positive x y)))
#+end_src

However, after reading the Emacs source code, I came up with this
not-so-different version that does some unnecessary calculations but uses the
Emacs way. To understand =c-fmod=, see [[*The iterative C version][the iterative C version]].

#+begin_src scheme
;; Calculate remainder of X by Y, supporting floating point and negative values.
(define (fmod x y)
  ;; Equivalent function to fmod() from C's math.h
  (define (c-fmod x y)
    (let ((abs-x (abs x))
          (abs-y (abs y)))
      (if (< abs-x abs-y)
          x
          (let ((abs-result (c-fmod (- abs-x abs-y) abs-y)))
            (if (< x 0)
                (- abs-result)
                abs-result)))))

  (let ((result (c-fmod x y)))
    (if (or (and (< y 0) (> result 0))
            (and (>= y 0) (< result 0)))
        (+ result y)
        result)))
#+end_src

Then, after observing the outputs a bit more, I came up with an even better
version.

| X    | Y    | Result |
|------+------+--------|
| 9.5  | 2.5  | 2.0    |
| 9.5  | -2.5 | -0.5   |
| -9.5 | 2.5  | 0.5    |
| -9.5 | -2.5 | -2.0   |

We can see that the output changes depending on the input signs. Here, ~AbsMod~
represents the modulus of $|x|$ and $|y|$.

| X        | Y        | Result           |
|----------+----------+------------------|
| Positive | Positive | ~AbsMod(x, y)~     |
| Positive | Negative | ~y + AbsMod(x, y)~ |
| Negative | Positive | ~y - AbsMod(x, y)~ |
| Negative | Negative | ~-AbsMod(x, y)~    |

With this in mind, an even better version can be written.

#+begin_src scheme
;; Calculate remainder of X by Y, supporting floating point and negative values.
(define (fmod x y)
  ;; Calculate remainder of X by Y, as long as they are both positive.
  (define (fmod-positive x y)
    (if (< x y)
        x
        (fmod-positive (- x y) y)))

  (let ((abs-result (fmod-positive (abs x) (abs y))))
    (cond ((and (positive? x) (positive? y))
           abs-result)
          ((and (positive? x) (negative? y))
           (+ y abs-result))
          ((and (negative? x) (positive? y))
           (- y abs-result))
          ((and (negative? x) (negative? y))
           (- abs-result)))))
#+end_src

Some examples using any of my Scheme functions:

#+begin_src scheme :results verbatim
(list
 (fmod 9 4)
 (fmod 9 -4)
 (fmod -9 4)
 (fmod -9 -4)
 (fmod 9.5 2.5)
 (fmod 9.5 -2.5)
 (fmod -9.5 2.5)
 (fmod -9.5 -2.5))
#+end_src

#+RESULTS:
: (1 -3 3 -1 2.0 -0.5 0.5 -2.0)

Those same examples using =mod= in Emacs Lisp:

#+begin_src emacs-lisp :results verbatim
(list
 (mod 9 4)
 (mod 9 -4)
 (mod -9 4)
 (mod -9 -4)
 (mod 9.5 2.5)
 (mod 9.5 -2.5)
 (mod -9.5 2.5)
 (mod -9.5 -2.5))
#+end_src

#+RESULTS:
: (1 -3 3 -1 2.0 -0.5 0.5 -2.0)

